init.el
;;; init.el -*- lexical-binding: t; -*-
(require 'package)

(defconst mage-emacs-dir
  (eval-when-compile (file-truename user-emacs-directory)))
(defconst mage-local-dir (concat mage-emacs-dir ".local/"))
(defconst mage-package-dir (concat mage-local-dir "packages/"))
(defconst mage-cache-dir (concat mage-local-dir "cache/"))
(defconst mage-etc-dir (concat mage-local-dir "etc/"))
(defconst mage-ext-dir (concat mage-emacs-dir "site-lisp/"))

(setq user-emacs-directory (file-name-directory load-file-name))
(setq package-user-dir (concat mage-package-dir "elpa/"))
(unless (file-directory-p package-user-dir)
  (make-directory package-user-dir))

(setq-default custom-file                  (concat mage-emacs-dir "custom.el")
	  abbrev-file-name             (concat mage-local-dir "abbrev.el")
	  auto-save-list-file-name     (concat mage-cache-dir "autosave")
	  backup-directory-alist       (list (cons "." (concat mage-cache-dir "backup/")))
	  mc/list-file                 (concat mage-etc-dir "mc-lists.el")
	  pcache-directory             (concat mage-cache-dir "pcache/")
	  request-storage-directory    (concat mage-cache-dir "request")
	  server-auth-dir              (concat mage-cache-dir "server/")
	  shared-game-score-directory  (concat mage-etc-dir "shared-game-score/")
	  tramp-auto-save-directory    (concat mage-cache-dir "tramp-auto-save/")
	  tramp-backup-directory-alist backup-directory-alist
	  tramp-persistency-file-name  (concat mage-cache-dir "tramp-persistency.el")
	  url-cache-directory          (concat mage-cache-dir "url/")
	  url-configuration-directory  (concat mage-etc-dir "url/"))

(defvar  mage--file-name-handler-alist file-name-handler-alist)
  (defun mage|pre-init()
  (setq gc-cons-threshold 402653184
	gc-cons-percentage 1.0
	file-name-handler-alist nil
  ))
(defun mage|post-init ()
	 (setq gc-cons-threshold 16777216
	   gc-cons-percentage 0.15
	   file-name-handler-alist mage--file-name-handler-alist))
(add-hook 'before-init-hook #'mage|pre-init)
(add-hook 'emacs-startup-hook #'mage|post-init)

(dolist (package-path (directory-files package-user-dir t))
  (if (directory-name-p package-path)
      (add-to-list 'load-path package-path)))

(defvar mage-init-time 'nil)
(defun mage-display-benchmark()
  (message "Mage loaded %s packages in %.03fs"
           (length package-activated-list)
           (or mage-init-time
               (setq mage-init-time
                     (float-time (time-subtract (current-time) before-init-time))))))
(add-hook 'emacs-startup-hook #'mage-display-benchmark)

(if (fboundp 'tool-bar-mode)   (tool-bar-mode -1))
(if (fboundp 'menu-bar-mode)   (menu-bar-mode -1))
(if (fboundp 'scroll-bar-mode) (scroll-bar-mode -1))

(setq-default initial-major-mode 'fundamental-mode)

(load custom-file t t t)

(when (fboundp 'set-charset-priority)
  (set-charset-priority 'unicode))     
(prefer-coding-system        'utf-8)
(set-terminal-coding-system  'utf-8)
(set-keyboard-coding-system  'utf-8)
(set-selection-coding-system 'utf-8)
(setq locale-coding-system   'utf-8)
(setq-default buffer-file-coding-system 'utf-8)

(setq-default debug-on-error nil)

(setq-default initial-scratch-message nil)

(setq-default inhibit-startup-screen t)

(setq-default auto-save-default nil
	  create-lockfiles nil
	  make-backup-files nil
	  history-length 500)

(fset 'yes-or-no-p 'y-or-n-p)

(setq-default tab-width 4)

(setq package-enable-at-startup nil)
(package-initialize)

(setq package-archives '(("gnu"   . "http://elpa.emacs-china.org/gnu/")
                         ("melpa" . "http://elpa.emacs-china.org/melpa/")
			             ("org"   . "http://elpa.emacs-china.org/org/")))

(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))
(eval-when-compile
  (require 'use-package))
(setq use-package-verbose nil)
(setq use-package-always-ensure t)
(use-package use-package-ensure-system-package)

(setq load-prefer-newer t)

(use-package auto-compile
  :defer t
  :config (auto-compile-on-load-mode))

(use-package gruvbox-theme
  :config
  (load-theme 'gruvbox-dark-medium t))

(defun +my/better-font()
  (interactive)
  ;; english font
  (if (display-graphic-p)
  (progn
	(set-face-attribute 'default nil :font (format   "%s:pixelsize=%d" "Source Code Pro" 17)) ;; 11 13 17 19 23
	;; chinese font
	(dolist (charset '(kana han symbol cjk-misc bopomofo))
	  (set-fontset-font (frame-parameter nil 'font)
			charset
			(font-spec :family "WenQuanYi Micro Hei Mono" :size 20)))) ;; 14 16 20 22 28
))

(defun +my|init-font(frame)
  (with-selected-frame frame
(if (display-graphic-p)
	(+my/better-font))))

(if (and (fboundp 'daemonp) (daemonp))
(add-hook 'after-make-frame-functions #'+my|init-font)
  (+my/better-font))
