2017-12-01-emacs配置.org
** modeline
   #+BEGIN_SRC emacs-lisp
     (defun mode-line-fill (face reserve)
       "Return empty space using FACE and leaving RESERVE space on the right."
       (unless reserve
	 (setq reserve 20))
       (when (and window-system (eq 'right (get-scroll-bar-mode)))
	 (setq reserve (- reserve 3)))
       (propertize " "
		   'display `((space :align-to
				     (- (+ right right-fringe right-margin) ,reserve)))
		   'face face))

     (setq projectile-mode-line
	   (quote (:eval (when (and (fboundp 'projectile-project-p) (projectile-project-p))
			   (propertize (format " P[%s]" (projectile-project-name))
				       'face 'font-lock-variable-name-face)))))

     (setq buffer-name-mode-line
	   (quote (:eval (propertize "%b " 'face 'font-lock-string-face))))

     (setq major-mode-mode-line
	   (quote (:eval (propertize "%m " 'face 'font-lock-keyword-face))))

     (setq file-status-mode-line 
	   (quote (:eval (concat "["
				 (when (buffer-modified-p)
				   (propertize "Mod "
					       'face 'font-lock-warning-face
					       'help-echo "Buffer has been modified"))
				 (propertize (if overwrite-mode "Ovr" "Ins")
					     'face 'font-lock-preprocessor-face
					     'help-echo (concat "Buffer is in "
								(if overwrite-mode
								    "overwrite"
								  "insert") " mode"))
				 (when buffer-read-only
				   (propertize " RO"
					       'face 'font-lock-type-face
					       'help-echo "Buffer is read-only"))
				 "]"))))

     (setq flycheck-status-mode-line
	   (quote (:eval (when (boundp 'flycheck-last-status-change)
			   (pcase flycheck-last-status-change
			     (`finished
			      (let* ((error-counts (flycheck-count-errors flycheck-current-errors))
				     (errors (cdr (assq 'error error-counts)))
				     (warnings (cdr (assq 'warning error-counts)))
				     (face (cond (errors 'error)
						 (warnings 'warning)
						 (t 'success))))
				(propertize (concat "["
						    (cond
						     (errors (format "✗:%s" errors))
						     (warnings (format "❗:%s" warnings))
						     (t "✔"))
						    "]")
					    'face face))))))))



     (setq line-column-mode-line
	   (concat
	    "("
	    (propertize "%02l" 'face 'font-lock-type-face)
	    ":"
	    (propertize "%02c" 'face 'font-lock-type-face)
	    ")"))

     (setq encoding-mode-line
	   (quote (:eval (propertize 
			  (concat (pcase (coding-system-eol-type buffer-file-coding-system)
				    (0 "LF ")
				    (1 "CRLF ")
				    (2 "CR "))
				  (let ((sys (coding-system-plist buffer-file-coding-system)))
				    (if (memq (plist-get sys :category) '(coding-category-undecided coding-category-utf-8))
					"UTF-8"
				      (upcase (symbol-name (plist-get sys :name)))))
				  )))))

     (setq time-mode-line
	   (quote (:eval (propertize (format-time-string "%H:%M")))))

     (setq-default mode-line-format
		   (list
		    " %1"
		    major-mode-mode-line
		    " %1"
		    buffer-name-mode-line
		    " %1"
		    file-status-mode-line
		    " %1"
		    projectile-mode-line
		    " %1"
		    line-column-mode-line
		    " "
		    flycheck-status-mode-line
		    (mode-line-fill 'mode-line 15)
		    encoding-mode-line
		    " "
		    time-mode-line
		    ))
   #+END_SRC
** 彩色显示成对括号
   #+BEGIN_SRC emacs-lisp
     (use-package rainbow-delimiters
       :defer 1
       :config
       (add-hook 'prog-mode-hook 'rainbow-delimiters-mode))
   #+END_SRC
** TODO 高亮TODO
* 内置功能设置
** 保存最近打开文件
   #+BEGIN_SRC emacs-lisp
     (use-package recentf
       :defer 1
       :commands recentf-open-files
       :config
       (setq recentf-save-file (concat mage-cache-dir "recentf")
	     recentf-auto-cleanup 120
	     recentf-max-menu-items 0
	     recentf-max-saved-items 300
	     recentf-filename-handlers '(file-truename)
	     )
       ;; 关闭载入recentf文件的提示
       (cl-letf* (((symbol-function 'load-file) (lambda (file) (load file nil t) )))
	 (recentf-mode +1)))
   #+END_SRC
** 高亮成对括号
   #+BEGIN_SRC emacs-lisp
     (show-paren-mode +1)
   #+END_SRC
* 窗口增强
** 弹出窗口
   #+BEGIN_SRC emacs-lisp
(use-package popwin
  :defer 1
  :config
  (popwin-mode +1))
   #+END_SRC
* 编辑功能增强
** 成对编辑
   #+BEGIN_SRC emacs-lisp
	 (use-package smartparens
	   :config
	   (require 'smartparens-config)
	   (smartparens-global-mode +1)
	   )

 #+END_SRC
** 前后插入
   #+BEGIN_SRC emacs-lisp
     (use-package isolate
       :defer 1
       :load-path (lambda() (concat mage-ext-dir "isolate/"))
       :config
       (add-to-list 'isolate-pair-list
		    '(
		      (from . "os-\\(.*\\)4")
		      (to-left . (lambda(from)
				   (format "#+BEGIN_SRC %s\n" (match-string 1 from))))
		      (to-right . "\n#+END_SRC\n")
		      (condition . (lambda (_) (if (equal major-mode 'org-mode) t nil)))
		      )
		    ))


   #+END_SRC
** 自动保存
   #+BEGIN_SRC emacs-lisp
     (use-package auto-save
       :defer 1
       :load-path (mage-ext-dir)
       :config
       (setq auto-save-slient t))
   #+END_SRC
   - 触发自动保存, 默认关闭
     #+BEGIN_SRC emacs-lisp
       (defvar mage-auto-save-timer nil)

       (defun mage/toggle-auto-save()
	 (interactive)
	 (if mage-auto-save-timer
	     (progn
	       (cancel-timer mage-auto-save-timer)
	       (setq mage-auto-save-timer nil)
	       (message "auto-save disabled"))
	   (progn
	     (setq mage-auto-save-timer (auto-save-enable))
	     (message "auto-save enabled"))
	   ))

     #+END_SRC
** 撤销
   #+BEGIN_SRC emacs-lisp
     (use-package undo-tree
       :defer 1
       :config
       (setq undo-tree-auto-save-history nil
	     ;; undo-in-region is known to cause undo history corruption, which can
	     ;; be very destructive! Disabling it deters the error, but does not fix
	     ;; it entirely!
	     undo-tree-enable-undo-in-region nil
	     undo-tree-history-directory-alist
	     `(("." . ,(concat mage-cache-dir "undo-tree-hist/"))))
       (global-undo-tree-mode +1)

	;; compress undo history with xz
       (defun mage*undo-tree-make-history-save-file-name (file)
	 (cond ((executable-find "zstd") (concat file ".zst"))
	       ((executable-find "gzip") (concat file ".gz"))
	       (file)))
       (advice-add #'undo-tree-make-history-save-file-name :filter-return
		   #'mage*undo-tree-make-history-save-file-name)

       (defun mage*strip-text-properties-from-undo-history (&rest args)
	 (dolist (item buffer-undo-list)
	   (and (consp item)
		(stringp (car item))
		(setcar item (substring-no-properties (car item))))))
       (advice-add 'undo-list-transfer-to-tree :before #'mage*strip-text-properties-from-undo-history)

       (defun mage*compress-undo-tree-history (orig-fn &rest args)
	 (cl-letf* ((jka-compr-verbose nil)
		    (old-write-region (symbol-function #'write-region))
		    ((symbol-function #'write-region)
		     (lambda (start end filename &optional append _visit &rest args)
		       (apply old-write-region start end filename append 0 args))))
	   (apply orig-fn args)))
       (advice-add #'undo-tree-save-history :around #'mage*compress-undo-tree-history))

   #+END_SRC
** 快速跳转*avy*
   #+BEGIN_SRC emacs-lisp
     (use-package avy
       :defer 1
       :bind (("C-;" . avy-goto-char)))
   #+END_SRC
** 快速选取*expand-region*
   #+BEGIN_SRC emacs-lisp
     (use-package expand-region
       :defer 1
       :bind (("C-=" . er/expand-region)))
   #+END_SRC
* 其它优化
** 重新载入emacs配置
   #+BEGIN_SRC emacs-lisp
     (defun mage-reload-config()
       (interactive)
       (load user-init-file nil t))
   #+END_SRC
* 项目管理-projectile
  #+BEGIN_SRC emacs-lisp
    (use-package projectile
      :defer 1
      :init
      (setq projectile-cache-file (concat mage-cache-dir "projectile.cache")
	    projectile-enable-caching (not noninteractive)
	    projectile-indexing-method 'alien
	    projectile-known-projects-file (concat mage-cache-dir "projectile.projects")
	    projectile-require-project-root t
	    projectile-globally-ignored-file-suffixes '(".elc" ".pyc" ".o")
	    projectile-ignored-projects '("~/" "/tmp" "/usr/include"))
      :config
      (projectile-mode +1)
      )
  #+END_SRC
* 补全
