2017-12-01-emacs配置.org
** 代码补全-company
   - company
     #+BEGIN_SRC emacs-lisp
       (use-package company
	 :init
	 (setq company-idle-delay 0.2
	       company-tooltip-limit 10
	       company-minimum-prefix-length 2
	       company-dabbrev-downcase nil
	       company-dabbrev-ignore-case nil
	       company-dabbrev-code-other-buffers t
	       company-tooltip-align-annotations t
	       company-require-match 'never
	       company-global-modes
	       '(not comint-mode erc-mode message-mode help-mode gud-mode)
	       company-frontends '(company-pseudo-tooltip-frontend company-echo-metadata-frontend)
	       company-backends '((:separate company-capf company-yasnippet)))
	 :config
	 (global-company-mode +1))
     #+END_SRC

   - company-posframe
   #+BEGIN_SRC emacs-lisp
(use-package company-posframe
  :if (display-graphic-p)
  :after company
  :hook (company-mode . company-posframe-mode))

   #+END_SRC

** 片段补全-yasnippet
   #+BEGIN_SRC emacs-lisp
     (use-package yasnippet
       :defer t
       :commands (yas-minor-mode-on yas-expand yas-expand-snippet yas-lookup-snippet
				    yas-insert-snippet yas-new-snippet yas-visit-snippet-file)
       :init
       (add-hook 'prog-mode-hook #'yas-minor-mode-on))
     (use-package yasnippet-snippets
       :after yasnippet)
   #+END_SRC

** 其它补全 *ivy*
*** ivy
    #+BEGIN_SRC emacs-lisp
      (use-package ivy
	:config
	(setq ivy-initial-inputs-alist nil
	      ivy-wrap t
	      ivy-height 15
	      ivy-fixed-height-minibuffer t
	      ivy-format-function #'ivy-format-function-line
	      )
	(ivy-mode +1)
	:bind ([remap switch-to-buffer] . #'ivy-switch-buffer)
	)
    #+END_SRC
*** ivy-posframe
    #+BEGIN_SRC emacs-lisp
      (use-package ivy-posframe
	:after (ivy)
	:config
	(setq ivy-display-function #'ivy-posframe-display-at-point
	      ivy-fixed-height-minibuffer nil
	      ivy-posframe-parameters
	      `((min-width . 90)
		(min-height .,ivy-height)
		(internal-border-width . 10))))
    #+END_SRC
*** counsel
    #+BEGIN_SRC emacs-lisp
  (use-package counsel
       :after (ivy)
    :bind (([remap execute-extended-command] . counsel-M-x)
	   ([remap find-file]                . counsel-find-file)
	   ([remap find-library]             . find-library)
	   ([remap imenu]                    . counsel-imenu)
	   ([remap recentf-open-files]       . counsel-recentf)
	   ([remap org-capture]              . counsel-org-capture)
	   ([remape swiper]                  . counsel-grep-or-swiper)
	   ([remap describe-face]            . counsel-describe-face)
	   ([remap describe-function]        . counsel-describe-function)
	   ([remap describe-variable]        . counsel-describe-variable))

    :config
    (setq counsel-find-file-ignore-regexp "\\(?:^[#.]\\)\\|\\(?:[#~]$\\)\\|\\(?:^Icon?\\)"
	  counsel-rg-base-command "rg -zS --no-heading --line-number --color never %s ."
	  counsel-ag-base-command "ag -zS --nocolor --nogroup %s"
	  counsel-pt-base-command "pt -zS --nocolor --nogroup -e %s")
    )
    #+END_SRC
  
  

*** swiper
    #+BEGIN_SRC emacs-lisp
  (use-package swiper
  :defer 1
  :bind ("C-s" . swiper))
    #+END_SRC


*** counsel-projectile
    #+BEGIN_SRC emacs-lisp
(use-package counsel-projectile
  :after projectile
  :commands (counsel-projectile-find-file counsel-projectile-find-dir counsel-projectile-switch-to-buffer
                                          counsel-projectile-grep counsel-projectile-ag counsel-projectile-switch-project)
  :init
  :bind (([remap projectile-find-file]        . counsel-projectile-find-file)
         ([remap projectile-find-dir]         . counsel-projectile-find-dir)
         ([remap projectile-switch-to-buffer] . counsel-projectile-switch-to-buffer)
         ([remap projectile-grep]             . counsel-projectile-grep)
         ([remap projectile-ag]               . counsel-projectile-ag)
         ([remap projectile-switch-project]   . counsel-projectile-switch-project)))

    #+END_SRC

*** 模糊匹配
    #+BEGIN_SRC emacs-lisp
      (use-package flx
	:defer t
	:init
	(setq ivy-re-builders-alist
	      '((counsel-ag . ivy--regex-plus)
		(counsel-grep . ivy--regex-plus)
		(swiper . ivy--regex-plus)
		(t . ivy--regex-fuzzy))
	      ivy-initial-inputs-alist nil)
	)
    #+END_SRC
** 单词补全 *company-english-helper*
   #+BEGIN_SRC emacs-lisp
(use-package company-english-helper
  :defer t
  :commands (toggle-company-english-helper)
  :load-path (lambda() (concat mage-ext-dir "/english-helper")))
   #+END_SRC
* 帮助系统
** helpful
   #+BEGIN_SRC emacs-lisp
     (use-package helpful
       :defer 1
       :init
       (setq counsel-describe-function-function #'helpful-function
	     counsel-describe-variable-function #'helpful-variable)
       :bind (([remap describe-key] . helpful-key))
       )
   #+END_SRC

** whick-key
   #+BEGIN_SRC emacs-lisp
(use-package which-key
  :defer 1
  :init
  (setq which-key-sort-order #'which-key-prefix-then-key-order
        which-key-sort-uppercase-first nil
        which-key-add-column-padding 1
        which-key-max-display-columns nil
        which-key-min-display-lines 6
        which-key-side-window-slot -10)
  :config
  (which-key-mode +1)
  )
   #+END_SRC
* 语法检查
** flycheck
   #+BEGIN_SRC emacs-lisp
     (use-package flycheck
       :defer t
       )

   #+END_SRC
** flycheck-posframe
   #+BEGIN_SRC emacs-lisp
     (use-package flycheck-posframe
       :after flycheck
       :config (add-hook 'flycheck-mode-hook #'flycheck-posframe-mode))
   #+END_SRC
* lsp
** lsp-mode
   #+BEGIN_SRC emacs-lisp
  (use-package lsp-mode
    :defer 1
    :config
    (setq lsp-project-blacklist '("^/usr/")
	  lsp-highlight-symbol-at-point nil)
    (add-hook 'lsp-after-open-hook 'lsp-enable-imenu))
   #+END_SRC

** lsp-ui
   #+BEGIN_SRC emacs-lisp
  (use-package lsp-ui
    :after (lsp-mode)
    :hook (lsp-mode . lsp-ui-mode)
    :config
    (setq lsp-ui-sideline-enable nil
	  lsp-ui-sideline-show-symbol nil
	  lsp-ui-sideline-show-symbol nil
	  lsp-ui-sideline-ignore-duplicate t
	  lsp-ui-doc-max-width 50
	  )
    :bind (:map lsp-ui-peek-mode-map
	    ("h" . lsp-ui-peek--select-prev-file)
	    ("j" . lsp-ui-peek--select-next)
	    ("k" . lsp-ui-peek--select-prev)
	    ("l" . lsp-ui-peek--select-next-file)
	    :map lsp-ui-mode-map
	    ([remap xref-find-definitions] . lsp-ui-peek-find-definitions)
	    ([remap xref-find-references]  . lsp-ui-peek-find-references)
	    ))
   #+END_SRC

** company-lsp
   #+BEGIN_SRC emacs-lisp
     (use-package company-lsp
       :after (company lsp-mode)
       :init
       (setq company-lsp-cache-candidates nil)
       (add-hook 'lsp-mode-hook
		 (lambda()
		   (add-to-list (make-local-variable 'company-backends)
				'company-lsp)))
       )
   #+END_SRC

* c++
** cc-mode 
   #+BEGIN_SRC emacs-lisp
	 (use-package cc-mode
	   :init
	   (setq-default c-basic-offset tab-width)
	   :bind (:map c-mode-base-map
			  ("RET" . newline-and-indent))
	   :config
	   ;; smartparens do it
	   (c-toggle-electric-state -1)
	   (c-toggle-auto-newline -1)
	   (setq c-tab-always-indent nil
		 c-electric-flag nil)
	   (dolist (key '("#" "}" "/" "*" ";" "," ":" "(" ")" "\177"))
	   (define-key c-mode-base-map key nil))
	   (define-key c++-mode-map "<" nil)
	   (define-key c++-mode-map ">" nil)
	   (sp-with-modes '(c-mode c++-mode java-mode)
		 (sp-local-pair "{" nil :post-handlers '(("||\n[i]" "RET") ("| " "SPC")))
		 (sp-local-pair "/*" "*/" :post-handlers '(("||\n[i]" "RET")))
		 )
	   )
   #+END_SRC
** ccls
   #+BEGIN_SRC emacs-lisp
     (use-package ccls
       :ensure-system-package ccls
       :defer 1
       :init
       (defun mage-lang-ccls-enable()
	 (condition-case nil
	     (lsp-ccls-enable)
	   (user-error nil)))
       (add-hook 'c-mode-hook #'mage-lang-ccls-enable)
       (add-hook 'c++-mode-hook #'mage-lang-ccls-enable)
       :config
       ;; overlay is slow
       ;; Use https://github.com/emacs-mirror/emacs/commits/feature/noverlay
       (setq ccls-sem-highlight-method 'font-lock)
       (ccls-use-default-rainbow-sem-highlight)
       (setq ccls-executable "/usr/bin/ccls")
       ;;(setq ccls-extra-args '("--log-file=/tmp/cq.log"))
       (setq ccls-extra-init-params '(
				      :completion (:detailedLabel t)
				      :diagnostics (:frequencyMs 5000)
				      :index (:reparseForDependency 1)))
       (with-eval-after-load 'projectile
	 (progn (add-to-list 'projectile-globally-ignored-directories ".ccls-cache")
		(setq projectile-project-root-files-top-down-recurring
		      (append '("compile_commands.json"
				".ccls_root")
			      projectile-project-root-files-top-down-recurring))))
       )

   #+END_SRC

** clang-format
   #+BEGIN_SRC emacs-lisp
  (use-package clang-format
    :after (ccls)
    :commands (clang-format-region clang-format-buffer))
   #+END_SRC

