2017-12-01-emacs配置.org
** google-c-style
   #+BEGIN_SRC emacs-lisp
  (use-package google-c-style
    :defer 1
    :config
    (add-hook 'c-mode-hook #'google-set-c-style)
    (add-hook 'c++-mode-hook #'google-set-c-style))

   #+END_SRC

** cmake-project
   #+BEGIN_SRC emacs-lisp
     (use-package cmake-mode
       :defer 1)

       (use-package cmake-project
	 :ensure-system-package cmake
	 :defer 1
	 :load-path (mage-ext-dir)
	 :bind (("<f7>" . cp-cmake-build-project)
		("<f8>" . cp-cmake-run-project-with-args)))
   #+END_SRC
** modern-cpp-font-lock
   #+BEGIN_SRC emacs-lisp
     (use-package modern-cpp-font-lock
       :config
       (add-hook 'c++-mode-hook #'modern-c++-font-lock-mode))
   #+END_SRC
* Python
  #+BEGIN_SRC emacs-lisp

    (use-package python
      :defer 1
      :init
      (setq python-environment-directory mage-cache-dir
	    python-indent-guess-indent-offset-verbose nil
	    )
      :config

      (define-key python-mode-map (kbd "DEL") nil) ; interferes with smartparens

      (setq python-shell-interpreter "ipython"
	    python-shell-interpreter-args "-i --simple-prompt --no-color-info"
	    python-shell-prompt-regexp "In \\[[0-9]+\\]: "
	    python-shell-prompt-block-regexp "\\.\\.\\.\\.: "
	    python-shell-prompt-output-regexp "Out\\[[0-9]+\\]: "
	    python-shell-completion-setup-code
	    "from IPython.core.completerlib import module_completion"
	    python-shell-completion-string-code
	    "';'.join(get_ipython().Completer.all_completions('''%s'''))\n"))

    (use-package lsp-python
      :defer 1
      :after python
      :config
      (add-hook 'python-mode-hook #'lsp-python-enable))
  #+END_SRC
* TODO org
** 基本配置
  #+BEGIN_SRC emacs-lisp
    (defvar mage-org-dir "~/Documents/Org/")
    (use-package org
      :defer 1
      :ensure org-plus-contrib
      :config
      (setq org-ellipsis " ▼ "
	    org-src-window-setup 'current-window
	    org-image-actual-width '(400)
	    org-export-backends '(ascii html latex md odt pandoc)
	    org-ditaa-jar-path (concat mage-etc-dir "ditaa.jar")
	    org-agenda-files (list (concat mage-org-dir "gtd.org"))
	    )
      (setcar (nthcdr 0 org-emphasis-regexp-components) " \t('\"{[:nonascii:]")
      (setcar (nthcdr 1 org-emphasis-regexp-components) "- \t.,:!?;'\")}\\[[:nonascii:]")
      (org-set-emph-re 'org-emphasis-regexp-components org-emphasis-regexp-components)
      (org-element-update-syntax)
      )
    (use-package org-bullets
      :defer 1
      :config
      (add-hook 'org-mode-hook #'org-bullets-mode))

    (use-package ox-pandoc
      :defer 1)
  #+END_SRC

** org-capture
   #+BEGIN_SRC emacs-lisp
     (setq org-default-notes-file (expand-file-name "inbox.org" mage-org-dir))
     (global-set-key (kbd "C-c c") #'org-capture)
     (setq org-capture-templates nil)
     (with-eval-after-load 'org
       (require 'org-protocol))

     (setq org-capture-templates `(
	     ("P" "Protocol" entry (file+headline ,(concat mage-org-dir "web.org") "Inbox")
	     "* [[%:link]]\nSource: %u\n #+BEGIN_QUOTE\n%i\n#+END_QUOTE\n\n\n%?")
	     ("L" "Protocol Link" entry (file+headline ,(concat mage-org-dir "web.org") "Inbox")
	     "* %? [[%:link][%:description]] \nCaptured On: %U")
     ))
   #+END_SRC
* hexo+org博客配置
** 一些目录
   #+BEGIN_SRC emacs-lisp
(defvar mage-root-dir
  "~/Documents/Blog/"
  "Blog root directory.")

(defvar mage-img-dir
  (concat mage-root-dir "images/")
  "Blog's image directory.")

(defvar mage-res-url
  "http://source.xhcoding.cn/")
   #+END_SRC
** org-octpress
   #+BEGIN_SRC emacs-lisp

     (use-package ctable
       :defer 1)
     (use-package epic
       :defer 1)                 
     (use-package orglue
       :defer 1)                 

     (use-package org-octopress
       :after (ctable epic orglue)
       :load-path (lambda() (concat mage-ext-dir "org-octopress/"))
       :config
       (require 'ox-jekyll)
       (setq
	org-octopress-directory-top (expand-file-name "source" mage-root-dir)
	org-octopress-directory-posts (expand-file-name "source/_posts" mage-root-dir)
	org-octopress-directory-org-top mage-root-dir
	org-octopress-directory-org-posts (expand-file-name "blog" mage-root-dir)
	org-octopress-setup-file (expand-file-name "setupfile.org" mage-root-dir)
	)      
       )

     (defun mage/open-org-octopress()
       (interactive)
       (let ((buffer (get-buffer "Octopress")))
	 (if buffer
	     (switch-to-buffer buffer)
	   (org-octopress))))
   #+END_SRC

** 本地图片导出时更改链接
   ~/Documents/Blog/images/1.png ==> http://source.xhcoding.cn/1.png
   #+BEGIN_SRC emacs-lisp
     (defun mage*export-blog-image-url(filename)
       (if (equal
	    (string-match-p
	     (regexp-quote (expand-file-name mage-root-dir))
	     (expand-file-name filename))
	    0)
	   (concat  mage-res-url (string-trim-left filename mage-img-dir))
	 nil))


     (advice-add #'org-export-file-uri :before-until #'mage*export-blog-image-url)

   #+END_SRC

** 截屏，把链接存到剪贴板(kill-ring)
   #+BEGIN_SRC emacs-lisp
     (defun mage-kill-new-img-link(prefix imagename)
       (kill-new (format "[[file:%s%s]] " prefix imagename imagename)))


     ;;;###autoload
     (defun mage/capture-screenshot(basename)
       (interactive "sScreenshot name: ")
       (if (string-equal basename "")
	   (setq basename
		 (file-name-base buffer-file-name)))
       (setq filename (concat basename (format-time-string "_%Y%H%M%S")))
       (sleep-for 3)
       (call-process-shell-command
	(concat
	 "deepin-screenshot -s " (concat (expand-file-name mage-img-dir) filename)))
       (mage-kill-new-img-link
	mage-img-dir (concat filename ".png")))

   #+END_SRC

** 强制保存和导出所有博客
   #+BEGIN_SRC emacs-lisp
     (defun mage/org-save-and-export ()
       (interactive)
       (org-octopress-setup-publish-project)
       (org-publish-project "octopress" t))

   #+END_SRC
* 增强按键绑定
** hydra
   #+BEGIN_SRC emacs-lisp
  (use-package hydra
    :commands (defhydra))
  (use-package ivy-hydra
    :after (ivy hydra))
   #+END_SRC
** 按键绑定
*** Move
    #+BEGIN_SRC emacs-lisp

      (global-set-key
       (kbd "C-n")
       (defhydra hydra-move (:pre-body (next-line))
	 "move"
	 ("j" next-line)
	 ("k" previous-line)
	 ("l" forward-char)
	 ("L" forward-word)
	 ("H" backward-word)
	 ("a" beginning-of-line)
	 ("e" move-end-of-line)
	 ("E" end-of-buffer)
	 ("B" beginning-of-buffer)
	 ("v" scroll-up-command)
	 ;; Converting M-v to V here by analogy.
	 ("V" scroll-down-command)
	 ("c" recenter-top-bottom)
	 ("g" goto-line "go")
	 ("m" set-mark-command "mark" :bind nil)
	 ("q" nil "quit")
	 ))
    #+END_SRC
    
    #+BEGIN_SRC emacs-lisp
      (with-eval-after-load 'ivy
	(define-key ivy-minibuffer-map "\C-o"
	  (defhydra soo-ivy (:hint nil :color pink)
	    "
       Move     ^^^^^^^^^^ | Call         ^^^^ | Cancel^^ | Options^^ | Action _w_/_s_/_a_: %s(ivy-action-name)
      ----------^^^^^^^^^^-+--------------^^^^-+-------^^-+--------^^-+---------------------------------
       _g_ ^ ^ _k_ ^ ^ _u_ | _f_orward _o_ccur | _i_nsert | _c_alling: %-7s(if ivy-calling \"on\" \"off\") _C_ase-fold: %-10`ivy-case-fold-search
       ^↨^ _h_ ^+^ _l_ ^↕^ | _RET_ done     ^^ | _q_uit   | _m_atcher: %-7s(ivy--matcher-desc) _t_runcate: %-11`truncate-lines
       _G_ ^ ^ _j_ ^ ^ _d_ | _TAB_ alt-done ^^ | ^ ^      | _<_/_>_: shrink/grow
      "
	    ;; arrows
	    ("j" ivy-next-line)
	    ("k" ivy-previous-line)
	    ("l" ivy-alt-done)
	    ("h" ivy-backward-delete-char)
	    ("g" ivy-beginning-of-buffer)
	    ("G" ivy-end-of-buffer)
	    ("d" ivy-scroll-up-command)
	    ("u" ivy-scroll-down-command)
	    ("e" ivy-scroll-down-command)
	    ;; actions
	    ("q" keyboard-escape-quit :exit t)
	    ("C-g" keyboard-escape-quit :exit t)
	    ("<escape>" keyboard-escape-quit :exit t)
	    ("C-o" nil)
	    ("i" nil)
	    ("TAB" ivy-alt-done :exit nil)
	    ("C-j" ivy-alt-done :exit nil)
	    ;; ("d" ivy-done :exit t)
	    ("RET" ivy-done :exit t)
	    ("C-m" ivy-done :exit t)
	    ("f" ivy-call)
	    ("c" ivy-toggle-calling)
	    ("m" ivy-toggle-fuzzy)
	    (">" ivy-minibuffer-grow)
	    ("<" ivy-minibuffer-shrink)
	    ("w" ivy-prev-action)
	    ("s" ivy-next-action)
	    ("a" ivy-read-action)
	    ("t" (setq truncate-lines (not truncate-lines)))
	    ("C" ivy-toggle-case-fold)
	    ("o" ivy-occur :exit t))))
    #+END_SRC
*** File
    #+BEGIN_SRC emacs-lisp
      (with-eval-after-load 'projectile
	(defhydra hydra-file (global-map "C-c f")
	  "file"
	  ("f" counsel-find-file)
	  ("r" counsel-recentf)
	  ("p" counsel-projectile-switch-project)
	  ("q" nil)))
    #+END_SRC
