init.el

(defun my/name-of-buffers (n)
"Return the names of the first N buffers from `buffer-list'."
(let ((bns
	   (delq nil
		 (mapcar
		  (lambda (b)
		(unless (string-match "^ " (setq b (buffer-name b)))
		  b))
		  (buffer-list)))))
  (subseq bns 1 (min (1+ n) (length bns)))))

  ;; Given ("a", "b", "c"), return "1. a, 2. b, 3. c".
  (defun my/number-names (list)
"Enumerate and concatenate LIST."
(let ((i 0))
  (mapconcat
   (lambda (x)
	 (format "%d. %s" (cl-incf i) x))
   list
   ", ")))

  (defvar my/last-buffers nil)

  (defun my/switch-to-buffer (arg)
(interactive "p")
(switch-to-buffer
 (nth (1- arg) my/last-buffers)))

  (defun my/switch-to-buffer-other-window (arg)
(interactive "p")
(switch-to-buffer-other-window
 (nth (1- arg) my/last-buffers)))

  (global-set-key
   (kbd "C-c b")
   (defhydra my/switch-to-buffer (:exit t
				  :body-pre (setq my/last-buffers
						  (my/name-of-buffers 4)))
 "
  _o_ther buffers: %s(my/number-names my/last-buffers)

  "
 ("o" my/switch-to-buffer "this window")
 ("O" my/switch-to-buffer-other-window "other window")
 ("<escape>" nil)))

(defhydra hydra-toggle (global-map "C-c t")
"toggle"
("a" mage/toggle-auto-save)
("f" flycheck-mode)
)

(defhydra hydra-jump (global-map "C-c j")
"jump"
("c" avy-goto-char)
("e" avy-goto-word-0)
("w" avy-goto-word-1)
("(" avy-goto-open-paren)
(")" avy-goto-close-paren)
("j" flycheck-next-error)
("k" flycheck-previous-error)
)

(defhydra hydra-rectangle (:body-pre (rectangle-mark-mode 1)
				   :color pink
				   :hint nil
				   :post (deactivate-mark))
"
^_k_^       _w_ copy      _o_pen       _N_umber-lines            |\\     -,,,--,,_
  _h_   _l_     _y_ank        _t_ype       _e_xchange-point          /,`.-'`'   ..  \-;;,_
^_j_^       _d_ kill      _c_lear      _r_eset-region-mark      |,4-  ) )_   .;.(  `'-'
  ^^^^          _u_ndo        _g_ quit     ^ ^                     '---''(./..)-'(_\_)
  "
("k" rectangle-previous-line)
("j" rectangle-next-line)
("h" rectangle-backward-char)
("l" rectangle-forward-char)
("d" kill-rectangle)                    ;; C-x r k
("y" yank-rectangle)                    ;; C-x r y
("w" copy-rectangle-as-kill)            ;; C-x r M-w
("o" open-rectangle)                    ;; C-x r o
("t" string-rectangle)                  ;; C-x r t
("c" clear-rectangle)                   ;; C-x r c
("e" rectangle-exchange-point-and-mark) ;; C-x C-x
("N" rectangle-number-lines)            ;; C-x r N
("r" (if (region-active-p)
	 (deactivate-mark)
	   (rectangle-mark-mode 1)))
("u" undo nil)
("g" nil))      ;; ok
  (global-set-key (kbd "C-x SPC") 'hydra-rectangle/body)

(defhydra hydra-mark (:color blue :idle 1.5 :columns 4)
"Mark"
("m" set-mark-command "Set Mark" :bind nil)
	("d" er/mark-defun "Defun / Function")
	("f" er/mark-defun "Defun / Function")
	("w" er/mark-word "Word")
	("u" er/mark-url "Url")
	("e" mark-sexp "S-Expression")
	("E" er/mark-email "Email")
	("b" mark-whole-buffer "Buffer")
	("l" mage-mark-line "Line")
	("s" er/mark-sentence "Sentence")
	("p" er/mark-text-paragraph "Paragraph")
	("g" mark-page "Page")
	("S" er/mark-symbol "Symbol")
	("P" er/mark-symbol-with-prefix "Prefixed symbol")
	("q" er/mark-inside-quotes "Inside Quotes")
	("Q" er/mark-outside-quotes "Outside Quotes")
	("(" er/mark-inside-pairs "Inside Pairs")
	("[" er/mark-inside-pairs "Inside Pairs")
	("{" er/mark-inside-pairs "Inside Pairs")
	(")" er/mark-outside-pairs "Outside Pairs")
	("]" er/mark-outside-pairs "Outside Pairs")
	("}" er/mark-outside-pairs "Outside Pairs")
	("t" er/mark-inner-tag "Inner Tag")
	("T" er/mark-outer-tag "Outer Tag")
	("c" er/mark-comment "Comment")
	("a" er/mark-html-attribute "HTML Attribute")
	("." er/expand-region "Expand Region" :exit nil)
	("," er/contract-region "Contract Region" :exit nil))
  (global-set-key (kbd "C-SPC") #'hydra-mark/body)

(defhydra hydra-all (global-map "M-p" :hint nil)
"hydra-all"
("m" hydra-move/body)
("f" hydra-file/body)
("b" hydra-buffer/body)
("t" hydra-toggle/body)
("j" hydra-jump/body)
("q" nil))
